package java_qa.collections;

public class ListsApp {

  // Написать функцию которая принимает на вход массив ArrayList целых чисел (Integer) и
  // возвращает инвертированный массив
  // Вывести оба массива в консоль в методе main

  // Написать функцию которая принимает на вход два массива ArrayList целых чисел (Integer) и
  // возвращает массив содержащий суммы соответствующих парных элементов
  // Если массивы имею разную длину, недостающие элементы считать равными нулю

  public static void main(String[] args) {

  }
}
